/*=========================================================*/
/*
var a = [1, 2, 3];
function test(b) {
  b.push(4);
}
test(a);
console.log(a) // [1, 2, 3, 4]
*/
/*=========================================================*/
/*
var arr = ['1', '2', '3'].map(parseInt);
console.log(arr) // [1, NaN, NaN]
//Array.prototype.map передает в функцию-коллбэк 3 аргумента: элемент массива, индекс элемента и сам массив. А у parseInt 2 аргумента: число или подобное ему и система счисления.
*/
/*=========================================================*/
/*
var a = [];
console.log((a == a) + ' ' + (a == !a)); //true true
//В первом выражении все понятно, идет сравнение ссылки с самой собой. А во втором операнд "!a" преобразовывается к boolean и соответственно порождает преобразование к boolean операнда "a". []==false (пустой массив => false), ![]==false (ссылка на объект (в данном случае на массив) с оператором ! => false) т.е. [] == ![]
*/
/*=========================================================*/

