
/*=========================================================*/
/*
let return = 5;
let for = 'aa';
let let = false;
console.log(return + for + let); //SyntaxError: Unexpected token 'return'

let obj = {
  for: 1,
  let: 2,
  return: 3
}
console.log(obj.for + obj.let + obj.return) / 6
*/
/*=========================================================*/
/*
console.log(null || 2 && 3 || 4); //3
// Приоритет && выше, чем ||, поэтому он выполнится первым.
// Результат 2 && 3 = 3, поэтому выражение приобретает вид:
// null || 3 || 4
// Теперь результатом является первое истинное значение: 3
*/
/*=========================================================*/

