/*=========================================================*/
/*
// У какого оператора из перечисленных наивысший приоритет
Присваивание =//3
Постфиксный инкремент ++ //17
Сложение + //16
Деление / //14
Возведение в степень ** //15
*/
/*=========================================================*/
/*
что лишнее
Number, String, Boolean, Object, null, undefined, Symbol // Object, так как все остальные это примитивные типы данных.
*/
/*=========================================================*/
/*
let a = 5;
Постфиксный инкремент: a++
Префиксный инкремент: ++a
Постфиксный декремент: a--
Префиксный декремент: --a
*/
/*=========================================================*/